#### Terraform Init: `✅`
#### Terraform Plan: `✅ 2 to add, 5 to change, 2 to destroy.`

<details>
<summary>Show Plan</summary>

```
data.cloudinit_config.this: Reading...
data.hetznerdns_zone.this: Reading...
hcloud_ssh_key.default: Refreshing state... [id=24905759]
data.hcloud_image.this: Reading...
hcloud_network.this: Refreshing state... [id=10373733]
hcloud_firewall.basic: Refreshing state... [id=1748182]
data.cloudinit_config.this: Read complete after 0s [id=1483594532]
hcloud_server.projects-server: Refreshing state... [id=63169265]
data.hetznerdns_zone.this: Read complete after 1s [id=iFtghhzsF25nw7Wqa2JMsJ]
hcloud_network_subnet.this: Refreshing state... [id=10373733-10.0.1.0/24]
data.hcloud_image.this: Read complete after 2s
hcloud_server_network.this: Refreshing state... [id=63169265-10373733]
hetznerdns_record.bookmarks: Refreshing state... [id=da4433c705ee878f5f69348f54b956ef]
hetznerdns_record.homepage: Refreshing state... [id=912db7ec956005d7343406b8b2adb320]
hcloud_volume.this: Refreshing state... [id=101632658]
hetznerdns_record.bookmarks-api: Refreshing state... [id=81253d86efc1c38e4afb06c662d6a409]
hetznerdns_record.geometrierechner: Refreshing state... [id=ec7af5d1c5e38277f29fb0a68ab796b1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_server.projects-server will be destroyed
  # (because hcloud_server.projects-server is not in configuration)
  - resource "hcloud_server" "projects-server" {
      - allow_deprecated_images    = false -> null
      - backups                    = false -> null
      - datacenter                 = "fsn1-dc14" -> null
      - delete_protection          = false -> null
      - firewall_ids               = [
          - 1748182,
        ] -> null
      - id                         = "63169265" -> null
      - ignore_remote_firewall_ids = false -> null
      - image                      = "232247483" -> null
      - ipv4_address               = "188.245.227.94" -> null
      - ipv6_address               = "2a01:4f8:c012:20a7::1" -> null
      - ipv6_network               = "2a01:4f8:c012:20a7::/64" -> null
      - keep_disk                  = false -> null
      - labels                     = {} -> null
      - location                   = "fsn1" -> null
      - name                       = "personal-projects" -> null
      - placement_group_id         = 0 -> null
      - primary_disk_size          = 40 -> null
      - rebuild_protection         = false -> null
      - server_type                = "cx22" -> null
      - shutdown_before_deletion   = false -> null
      - ssh_keys                   = [
          - "24905759",
        ] -> null
      - status                     = "running" -> null
      - user_data                  = "Bb9ea7VjUzNKddFPuva0yrcc0wI=" -> null
        # (1 unchanged attribute hidden)
    }

  # hcloud_server.this will be created
  + resource "hcloud_server" "this" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 1748182,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "232247483"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "fsn1"
      + name                       = "personal-projects"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + ssh_keys                   = [
          + "24905759",
        ]
      + status                     = (known after apply)
      + user_data                  = "Bb9ea7VjUzNKddFPuva0yrcc0wI="
    }

  # hcloud_server_network.this must be replaced
-/+ resource "hcloud_server_network" "this" {
      - alias_ips   = [] -> null
      ~ id          = "63169265-10373733" -> (known after apply)
      ~ mac_address = "86:00:00:c7:ad:12" -> (known after apply)
      ~ server_id   = 63169265 -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # hcloud_volume.this will be updated in-place
  ~ resource "hcloud_volume" "this" {
        id                = "101632658"
        name              = "persistent-storage"
      ~ server_id         = 63169265 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # hetznerdns_record.bookmarks will be updated in-place
  ~ resource "hetznerdns_record" "bookmarks" {
        id      = "da4433c705ee878f5f69348f54b956ef"
        name    = "bookmarks"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.bookmarks-api will be updated in-place
  ~ resource "hetznerdns_record" "bookmarks-api" {
        id      = "81253d86efc1c38e4afb06c662d6a409"
        name    = "api.bookmarks"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.geometrierechner will be updated in-place
  ~ resource "hetznerdns_record" "geometrierechner" {
        id      = "ec7af5d1c5e38277f29fb0a68ab796b1"
        name    = "geometrierechner"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.homepage will be updated in-place
  ~ resource "hetznerdns_record" "homepage" {
        id      = "912db7ec956005d7343406b8b2adb320"
        name    = "@"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  ~ server_ip = "188.245.227.94" -> (known after apply)
  ~ status    = "running" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>